app/views/api/expenses/_expense.json.jbuilder

json.extract! expense, :id, :owner_id, :amount, :description, :split_option
json.allExpenseMembers expense.users.pluck(:user_id)
json.balances Hash[expense.expense_members.map{ |expense_member| [expense_member.user_id, expense_member.balance]}]
---
SELECT "user_id" FROM "users" INNER JOIN "expense_members" ON "users"."id" = "expense_members"."user_id" WHERE "expense_members"."expense_id" = $1  [["expense_id", 2]]
SELECT "expenses".* FROM "expenses" INNER JOIN "expense_members" ON "expenses"."id" = "expense_members"."expense_id" WHERE "expense_members"."user_id" = $1  [["user_id", 1]]
SELECT "expense_members"."balance" FROM "expense_members" WHERE "expense_members"."expense_id" = $1  [["expense_id", 2]]
SELECT "users".* FROM "users"